{"c4p":{"content":"We announced **GDG DevFest Tyumen** - a large specialized conference for developers. The conference will bring together more than 200 developers, managers and entrepreneurs on **15 November 2019** in Tyumen. This will be the first specialized conference of its kind in Tyumen and we will try to make it memorable and useful for all participants. The speakers of the conference will reveal the topics of Web, Cloud, Mobile and management. **We are looking for speakers like you!** To make the hall shiver with admiration for your coolness, your best practices and practical workshops.  <div layout horizontal center-justified> <a href=\"/\" rel=\"noopener noreferrer\">   <paper-button primary>Submit a proposal</paper-button> </a> </div>  <h1>Why is it cool to speak at the DevFest?</h1> We are focused on the quality and variety of content. Our goal is to make sure that both speakers and participants get the most out of the conference. For speakers, we have these benefits: 1) **Coverage of expenses.** Travel and accommodation for 1 night. The party with other speakers and organizers is included. 2) **Professional video shooting.** Each of the two streams of the conference will be recorded and after editing will be available on youTube. 3) **Self-presentation.** As a speaker at our conference you demonstrate a high level of expertise to your potential partners and employees. We will talk about you in our online resources. 4) **Unique networking.** As a speaker you have the opportunity to communicate more closely with other speakers - the best experts in their field. 5) **Coaching.** We are in the same boat. After confirming you as a speaker, we will provide maximum support. We will provide information about the audience, a presentation template, feedback on the presentation, practicing the presentation on Skype and everything else for the preparation.  <h1>What are we looking for?</h1> We are looking for practice-oriented speeches. We need your experience, your discoveries at the forefront of technical thought. We don't need information that you can google or read in the documentation. Topics include Web, Cloud, Machine Learning, Managment, Mobile. If you think that your topic does not fit into these limits - write us about it anyway, we will try to come up with something.  <h1>Format</h1> You can submit as many talks as you want. We accept applications for 2 formats: a 40-minute speech and a 2-3-hour workshop. <h1>Timeline</h1> **Call for Papers submission deadline is November 1, 2019.** Submission results will be announced every week after September 15.   Any questions? Email organizers at [devfest@gdgtmn.com](mailto:devfest@gdgtmn.com) <div layout horizontal center-justified> <a href=\"/\" rel=\"noopener noreferrer\">   <paper-button primary>Submit a proposal</paper-button> </a> </div>","title":"We're looking for speakers","brief":"We announced GDG DevFest Tyumen - a large specialized conference for developers. The conference will bring together more than 200 developers, managers and...","published":"2019-09-01","backgroundColor":"#3647a5","source":"/data/posts/2017-02-12-c4p.md","image":"/images/posts/c4p.jpg"}}